#include <stdio.h>
#include <math.h>

int main (void)
{
//ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ
// // // 새로운 함수 math.h 예문

//     double x,y;

//     printf("실수 x 입력 :");
//     scanf("%lf", &x);
//     printf("실수 y 입력 :");
//     scanf("%lf", &y);

//     printf("\n[math.h 함수 예제]\n");
//     printf("sqrt(x) = %.4f\n", sqrt(x)); //제곱근
//     printf("pow(x,y) = %.4f\n", pow(x,y)); // x의y제곱
//     printf("sin(x) = %.4f\n", sin(x)); // 삼각함수 (단위는 라디안)
//     printf("cos(x) = %.4f\n", cos(x));
//     printf("log(x) = %.4f\n", log(x));
//     printf("fabs(x) = %.4f\n", fabs(x));
//     // 실행 코드 : gcc test6.c -o math -lm 실행 이후 ./math 입력 > 실수입력 칸 나옴

//ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ

// //while 문 : while (조건식) { 실행문; }
//     int a = 1;
//     while (a<10)
//     {
//         a = a*2;
//     }
//     printf("a : %d\n",a);
// // 1*2, 2*2, 4*2, 8*2, 16 : a<10 거짓 이므로 출력16
// a의 초기 값이 1이 아닌 10보다 큰 수일 경우 1회도 반복되지 않고 바로 그 a 값이 출력됨.


//ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ

// // for 문 : for (초기식; 조건식; 증감식) { 살행문; }
//     int a = 1;
//     int i;
//     for (i=0; i <3; i++)
//     {
//         a = a * 2;
//     }
//     printf("a : %d\n",a);
// // i=0 1*2, i=1 2*2, i=2 4*2 i=3이므로 멈춤 > 8출력
// // for 문 내부는 ";" 으로 구분 ","가 아님
// 초기식은 최초 한 번 실행됨. ex) i=0 이 아닌 printf("실행문을 시작합니다.") 와 같은 실행문도 for문 안의 초기식으로 쓸 수 있음


//ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ

// // do~while 문 : do { 실행문; } while (조건식);
//     int a = 1 ;
//     do
//     {
//         a = a *2;

//     } while (a<10);
//     printf("a : %d\n", a);
// // do~while 문 특징 : 1회는 반드시 실행한다. 
// // a 가 10보다 큰 수여도 1번은 실행 됨. (do 안에 a= a*2 식이 있기 때문에 while을 거치기 전에 위 식이 먼저 실행되기 때문에)

//ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ

// // 중첩 반복문 
//     int i,j;
//     for (i=0; i <3; i++)
//     {
//         for (j=0; j<5; j++)
//         {
//             printf("*");
//         }
//         printf("\n");
//     }
    
//ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ

// // 별 찍기
//     int i,j;
//     for (i=0; i <5; i ++)
//     {
//         for (j=5; j>i; j--)
//         {
//             printf("*");
//         }
//         printf("\n");
//     }
// // 1회 j=5,i=0 -> ***** / 2회 j=5,i=1 -> **** ...

//ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ

// // 구구단 출력 for문 활용
//     int i,j;
//     for (i=2;i<=9;i++){
//         for(j=1;j<=9;j++){
//             printf("%d * %d = %d\n", i,j, i*j);   
//         }
//         printf("ㅡㅡㅡㅡㅡㅡㅡㅡ\n");
//     }

//ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ

//break 문
    // int i;
    // int sum = 0;

    // for (i = 1; i <= 10; i++){

    //     sum += i;
    //     if (sum > 30) break;
    // }
    // printf("누적된 값 : %d\n", sum);
    // printf("마지막으로 더한 값 : %d\n", i);


// while(...){
//     for(...){
//             ...
//             if (...) break;
//         }
// } 라면 안쪽 for문 하나만 탈출
//ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ
//  while(...){
//         ...
//         if(...){
//             ...
//             break;
//         } 
//     }라면 문장 밖으로 탈출

//ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ

// //continue 분기문
// int i,sum;

// for (i=1; i<=100; i++){

//     if((i%3)==0){

//         continue;
//     }
//     sum+=i;
// }
// // i 가 3의 배수면 sum +=i 문장을 건너띄고 블록 끝으로 간 후에 다시 반복
// // 1+2+4+5+7... (1-100까지의 수 중 3의 배수인 숫자를 제외한 모든 수를 더한 값이 출력됨)

//ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ

// // 무한 반복문
// while(1){} -> (1 = True)ㄴ
// for(;;) {} -> (초기식;조건식;증감식)자리에 빈칸
// 으로 무한 반복문 가능 
// break로 탈출

//ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ

// 함수 : 함수명, 매개변수, 반환형으로 함수 원형을 만든다.
// 원하는 기능의 함수를 직접 만들기 위해 사용
// 매개변수: 함수가 기능을 수행하는 데 필요한 데이터, 반환형: 함수가 수행된 후의 결과
// ex) int sum (int x, int y) ---> int(반환형) / sum(함수명) / int x,int y(매개변수) 변수 이름은 생략 가능 (그냥 int,int로 써도 됨)
// 함수 원형에 함수의 실행코드를 중괄호 안에 넣어 완성한다.

//ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ

    return 0 ;
}